Revit 2024 API
FabricationConfiguration.GetPartCustomDataName Method
 Gets the custom data name from its identifier.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017 Subscription Update
Syntax
C#
public string GetPartCustomDataName(
	int customDataId
)
Visual Basic
Public Function GetPartCustomDataName ( _
	customDataId As Integer _
) As String
Visual C++
public:
String^ GetPartCustomDataName(
	int customDataId
)
Parameters
customDataId
Type: System.Int32
 The custom data identifier.
Return Value
 The custom data name.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The custom data does not exist.
See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace